#### Terraform Plan Results 📋

| Check | Status |
|-------|--------|
| 🖌 Format | `success` |
| ⚙️ Initialization | `success` |
| 🤖 Validation | `success` |
| 📝 TFLint | `failure` |
| 🔒 TFSec | `failure` |
| 🛡️ Terrascan | `success` |
| 📖 Plan | `success` |

<details>
<summary>📄 Show Terraform Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.alb.aws_lb.presentation_alb will be created
  + resource "aws_lb" "presentation_alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "presentation-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + region                                                       = "us-east-1"
      + secondary_ips_auto_assigned_per_subnet                       = (known after apply)
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Name"        = "sincerra-vpc-serverbased-dev-Internet-Facing App Load Balancer"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + tags_all                                                     = {
          + "Name"        = "sincerra-vpc-serverbased-dev-Internet-Facing App Load Balancer"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # module.alb.aws_lb_listener.presentation_alb_listener will be created
  + resource "aws_lb_listener" "presentation_alb_listener" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + region                                                                = "us-east-1"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb.aws_lb_target_group.frontend_alb_target_group will be created
  + resource "aws_lb_target_group" "frontend_alb_target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "presentation-alb-tg"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + region                             = "us-east-1"
      + slow_start                         = 0
      + tags                               = {
          + "Name"        = "sincerra-vpc-serverbased-dev-presentation-alb-tg"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + tags_all                           = {
          + "Name"        = "sincerra-vpc-serverbased-dev-presentation-alb-tg"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # module.backend_alb.aws_lb.backend_alb will be created
  + resource "aws_lb" "backend_alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = true
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "backend-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + region                                                       = "us-east-1"
      + secondary_ips_auto_assigned_per_subnet                       = (known after apply)
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Name"        = "sincerra-vpc-serverbased-dev-Backend Internal Load Balancer"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + tags_all                                                     = {
          + "Name"        = "sincerra-vpc-serverbased-dev-Backend Internal Load Balancer"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # module.backend_alb.aws_lb_listener.backend_alb_listener will be created
  + resource "aws_lb_listener" "backend_alb_listener" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + region                                                                = "us-east-1"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.backend_alb.aws_lb_target_group.backend_alb_target_group will be created
  + resource "aws_lb_target_group" "backend_alb_target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "backend-alb-tg"
      + name_prefix                        = (known after apply)
      + port                               = 3001
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + region                             = "us-east-1"
      + slow_start                         = 0
      + tags                               = {
          + "Name"        = "sincerra-vpc-serverbased-dev-presentation-alb-tg"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + tags_all                           = {
          + "Name"        = "sincerra-vpc-serverbased-dev-presentation-alb-tg"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # module.backend_asg.aws_autoscaling_group.backend_asg will be created
  + resource "aws_autoscaling_group" "backend_asg" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 2
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "backend_asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + region                           = "us-east-1"
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "frontend-instance"
        }
    }

  # module.backend_asg.aws_iam_instance_profile.backend_instance_profile will be created
  + resource "aws_iam_instance_profile" "backend_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "backend-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "backend-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.backend_asg.aws_iam_role.backend_role will be created
  + resource "aws_iam_role" "backend_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "backend-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.backend_asg.aws_iam_role_policy_attachment.backend_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "backend_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ReadOnlyAccess"
      + role       = "backend-role"
    }

  # module.backend_asg.aws_launch_template.backend_launch_template will be created
  + resource "aws_launch_template" "backend_launch_template" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-0ecb62995f68bb549"
      + instance_type          = "t3.micro"
      + key_name               = "sabbah"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "backend-launch-template"
      + region                 = "us-east-1"
      + tags_all               = (known after apply)
      + user_data              = "IyEvYmluL2Jhc2gKCiMgVXBkYXRlIHN5c3RlbQplY2hvICJVcGRhdGluZyBzeXN0ZW0uLi4iCnl1bSB1cGRhdGUgLXkKCiMgSW5zdGFsbCByZXF1aXJlZCB0b29scwplY2hvICJJbnN0YWxsaW5nIGN1cmwsIGdpdCwgdW56aXAuLi4iCnl1bSBpbnN0YWxsIC15IGN1cmwgZ2l0IHVuemlwCgojIEluc3RhbGwgQVdTIENMSSAoZm9yIGZldGNoaW5nIEFMQiBETlMpCmlmICEgY29tbWFuZCAtdiBhd3MgJj4gL2Rldi9udWxsOyB0aGVuCiAgICBlY2hvICJJbnN0YWxsaW5nIEFXUyBDTEkuLi4iCiAgICBjdXJsICJodHRwczovL2F3c2NsaS5hbWF6b25hd3MuY29tL2F3c2NsaS1leGUtbGludXgteDg2XzY0LnppcCIgLW8gImF3c2NsaXYyLnppcCIKICAgIHVuemlwIGF3c2NsaXYyLnppcAogICAgLi9hd3MvaW5zdGFsbAogICAgcm0gLXJmIGF3cyBhd3NjbGl2Mi56aXAKZmkKCiMgSW5zdGFsbCBOb2RlLmpzIDE4CmVjaG8gIkluc3RhbGxpbmcgTm9kZS5qcyAxOC4uLiIKY3VybCAtc0wgaHR0cHM6Ly9ycG0ubm9kZXNvdXJjZS5jb20vc2V0dXBfMTgueCB8IGJhc2ggLQp5dW0gaW5zdGFsbCAteSBub2RlanMKCiMgQ2xvbmUgcmVwb3NpdG9yeQplY2hvICJDbG9uaW5nIGJhY2tlbmQgcmVwb3NpdG9yeS4uLiIKZ2l0IGNsb25lIGh0dHBzOi8vZ2l0aHViLmNvbS9zYWJiYWgtYWhtZWQvU2luY2VycmEtc3lzdGVtLVNlcnZlci1iYXNlZC5naXQgL29wdC9zaW5jZXJyYQpjZCAvb3B0L3NpbmNlcnJhL2JhY2tlbmQKCiMgSW5zdGFsbCBkZXBlbmRlbmNpZXMKZWNobyAiSW5zdGFsbGluZyBkZXBlbmRlbmNpZXMuLi4iCm5wbSBpbnN0YWxsIC0tcHJvZHVjdGlvbgoKIyBHZXQgZnJvbnRlbmQgQUxCIEROUyBmb3IgQ09SUwpGUk9OVEVORF9BTEJfRE5TPSQoYXdzIGVsYnYyIGRlc2NyaWJlLWxvYWQtYmFsYW5jZXJzIFwKICAgIC0tbmFtZXMgInByZXNlbnRhdGlvbi1hbGIiIFwKICAgIC0tcmVnaW9uIHVzLWVhc3QtMSBcCiAgICAtLXF1ZXJ5ICJMb2FkQmFsYW5jZXJzWzBdLkROU05hbWUiIFwKICAgIC0tb3V0cHV0IHRleHQpCgojIENyZWF0ZSBlbnZpcm9ubWVudCBmaWxlCmNhdCA+IC9vcHQvc2luY2VycmEvYmFja2VuZC8uZW52IDw8RU9GClBPUlQ9MzAwMQpOT0RFX0VOVj1wcm9kdWN0aW9uCkFXU19SRUdJT049dXMtZWFzdC0xCkZST05URU5EX1VSTD1odHRwOi8vJHtGUk9OVEVORF9BTEJfRE5TfQpFT0YKCiMgSW5zdGFsbCBQTTIgZ2xvYmFsbHkKZWNobyAiSW5zdGFsbGluZyBQTTIuLi4iCm5wbSBpbnN0YWxsIC1nIHBtMgoKIyBTdGFydCBhcHBsaWNhdGlvbiB3aXRoIFBNMgplY2hvICJTdGFydGluZyBiYWNrZW5kIHdpdGggUE0yLi4uIgpjZCAvb3B0L3NpbmNlcnJhL2JhY2tlbmQKcG0yIHN0YXJ0IHNyYy9zZXJ2ZXIuanMgLS1uYW1lIHNpbmNlcnJhLWJhY2tlbmQgLS1lbnYgcHJvZHVjdGlvbgoKIyBTYXZlIFBNMiBwcm9jZXNzIGxpc3QKcG0yIHNhdmUKCiMgU2V0dXAgUE0yIHRvIHN0YXJ0IG9uIGJvb3QKcG0yIHN0YXJ0dXAgc3lzdGVtZCAtdSByb290IC0taHAgL3Jvb3QKCmVjaG8gIuKchSBCYWNrZW5kIGRlcGxveWVkIHN1Y2Nlc3NmdWxseSEiCmVjaG8gIkJhY2tlbmQgcnVubmluZyBvbiBwb3J0IDMwMDEiCg=="
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile {
          + name = "backend-instance-profile"
        }
    }

  # module.frontend_asg.aws_autoscaling_group.frontend_asg will be created
  + resource "aws_autoscaling_group" "frontend_asg" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 2
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "frontend_asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + region                           = "us-east-1"
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "frontend-instance"
        }
    }

  # module.frontend_asg.aws_iam_instance_profile.frontend_instance_profile will be created
  + resource "aws_iam_instance_profile" "frontend_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "frontend-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "frontend-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.frontend_asg.aws_iam_role.frontend_role will be created
  + resource "aws_iam_role" "frontend_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "frontend-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.frontend_asg.aws_iam_role_policy_attachment.presentation_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "presentation_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ReadOnlyAccess"
      + role       = "frontend-role"
    }

  # module.frontend_asg.aws_launch_template.presentation_launch_template will be created
  + resource "aws_launch_template" "presentation_launch_template" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-0ecb62995f68bb549"
      + instance_type          = "t3.micro"
      + key_name               = "sabbah"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "frontend-launch-template"
      + region                 = "us-east-1"
      + tags_all               = (known after apply)
      + user_data              = "IyEvYmluL2Jhc2gKCiMgVXBkYXRlIHRoZSBzeXN0ZW0KZWNobyAiVXBkYXRpbmcgc3lzdGVtLi4uIgp5dW0gdXBkYXRlIC15CgojIEluc3RhbGwgcmVxdWlyZWQgdG9vbHMKZWNobyAiSW5zdGFsbGluZyBjdXJsLCBnaXQsIHVuemlwLi4uIgp5dW0gaW5zdGFsbCAteSBjdXJsIGdpdCB1bnppcAoKIyBJbnN0YWxsIEFXUyBDTEkgKGZvciBmdXR1cmUgdXNlIHRvIGZldGNoIEFMQiBETlMpCmlmICEgY29tbWFuZCAtdiBhd3MgJj4gL2Rldi9udWxsOyB0aGVuCiAgICBlY2hvICJJbnN0YWxsaW5nIEFXUyBDTEkuLi4iCiAgICBjdXJsICJodHRwczovL2F3c2NsaS5hbWF6b25hd3MuY29tL2F3c2NsaS1leGUtbGludXgteDg2XzY0LnppcCIgLW8gImF3c2NsaXYyLnppcCIKICAgIHVuemlwIGF3c2NsaXYyLnppcAogICAgLi9hd3MvaW5zdGFsbAogICAgcm0gLXJmIGF3cyBhd3NjbGl2Mi56aXAKZmkKCiMgSW5zdGFsbCBOb2RlLmpzIDE4CmVjaG8gIkluc3RhbGxpbmcgTm9kZS5qcyAxOC4uLiIKY3VybCAtc0wgaHR0cHM6Ly9ycG0ubm9kZXNvdXJjZS5jb20vc2V0dXBfMTgueCB8IGJhc2ggLQp5dW0gaW5zdGFsbCAteSBub2RlanMKCiMgSW5zdGFsbCBOZ2lueAplY2hvICJJbnN0YWxsaW5nIE5naW54Li4uIgphbWF6b24tbGludXgtZXh0cmFzIGluc3RhbGwgbmdpbngxIC15CgojIENsb25lIHRoZSBmdWxsIHJlcG9zaXRvcnkKZWNobyAiQ2xvbmluZyBTaW5jZXJyYSByZXBvc2l0b3J5Li4uIgpnaXQgY2xvbmUgaHR0cHM6Ly9naXRodWIuY29tL3NhYmJhaC1haG1lZC9TaW5jZXJyYS1zeXN0ZW0tc2VydmVybGVzcy0uZ2l0IC90bXAvc2luY2VycmEKCiMgTmF2aWdhdGUgdG8gZnJvbnRlbmQgZm9sZGVyCmNkIC90bXAvc2luY2VycmEvZnJvbnRlbmQKCiMgR2V0IGJhY2tlbmQgQUxCIEROUyBmb3IgQVBJIGVuZHBvaW50CmVjaG8gIkZldGNoaW5nIEJhY2tlbmQgQUxCIEROUy4uLiIKQkFDS0VORF9BTEJfRE5TPSQoYXdzIGVsYnYyIGRlc2NyaWJlLWxvYWQtYmFsYW5jZXJzIFwKICAgIC0tbmFtZXMgImJhY2tlbmQtYWxiIiBcCiAgICAtLXJlZ2lvbiB1cy1lYXN0LTEgXAogICAgLS1xdWVyeSAiTG9hZEJhbGFuY2Vyc1swXS5ETlNOYW1lIiBcCiAgICAtLW91dHB1dCB0ZXh0KQoKaWYgWyAtbiAiJEJBQ0tFTkRfQUxCX0ROUyIgXTsgdGhlbgogICAgZWNobyAiQmFja2VuZCBBTEIgRE5TOiAkQkFDS0VORF9BTEJfRE5TIgogICAgZWNobyAiVXBkYXRpbmcgQVBJIGVuZHBvaW50IGluIFJlYWN0IGFwcC4uLiIKICAgICMgUmVwbGFjZSB0aGUgaGFyZGNvZGVkIEFQSSBHYXRld2F5IFVSTCB3aXRoIGJhY2tlbmQgQUxCIEROUwogICAgZmluZCAuL3NyYyAtdHlwZSBmIC1uYW1lICIqLmpzIiAtZXhlYyBzZWQgLWkgXAogICAgICAic3xodHRwczovL3V6dDF0M3UzZmYuZXhlY3V0ZS1hcGkudXMtZWFzdC0xLmFtYXpvbmF3cy5jb20vYXBpfGh0dHA6Ly8ke0JBQ0tFTkRfQUxCX0ROU318ZyIge30gKwogICAgZWNobyAi4pyFIEFQSSBlbmRwb2ludCB1cGRhdGVkIHN1Y2Nlc3NmdWxseSIKZWxzZQogICAgZWNobyAi4pqg77iPICBXYXJuaW5nOiBDb3VsZCBub3QgcmV0cmlldmUgQmFja2VuZCBBTEIgRE5TLiBBUEkgY2FsbHMgbWF5IGZhaWwuIgpmaQoKIyBJbnN0YWxsIGRlcGVuZGVuY2llcwplY2hvICJJbnN0YWxsaW5nIGRlcGVuZGVuY2llcy4uLiIKbnBtIGluc3RhbGwKCiMgQnVpbGQgUmVhY3QgYXBwCmVjaG8gIkJ1aWxkaW5nIFJlYWN0IGFwcC4uLiIKbnBtIHJ1biBidWlsZAoKIyBEZXBsb3kgdG8gTmdpbngKZWNobyAiRGVwbG95aW5nIHRvIE5naW54Li4uIgpjcCAtciBidWlsZC8qIC91c3Ivc2hhcmUvbmdpbngvaHRtbC8KCiMgU2V0IHBlcm1pc3Npb25zCmNob3duIC1SIG5naW54Om5naW54IC91c3Ivc2hhcmUvbmdpbngvaHRtbAoKIyBDb25maWd1cmUgTmdpbnggZm9yIFJlYWN0IFJvdXRlcgp0ZWUgL2V0Yy9uZ2lueC9jb25mLmQvcmVhY3QuY29uZiA+IC9kZXYvbnVsbCA8PCdFT0YnCnNlcnZlciB7CiAgICBsaXN0ZW4gODA7CiAgICBzZXJ2ZXJfbmFtZSBfOwogICAgcm9vdCAvdXNyL3NoYXJlL25naW54L2h0bWw7CiAgICBpbmRleCBpbmRleC5odG1sOwogICAgCiAgICBsb2NhdGlvbiAvIHsKICAgICAgICB0cnlfZmlsZXMgJHVyaSAkdXJpLyAvaW5kZXguaHRtbDsKICAgIH0KfQpFT0YKCiMgU3RhcnQgTmdpbngKc3lzdGVtY3RsIHN0YXJ0IG5naW54CnN5c3RlbWN0bCBlbmFibGUgbmdpbngKCmVjaG8gIuKchSBGcm9udGVuZCBkZXBsb3llZCBzdWNjZXNzZnVsbHkhIgo="
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile {
          + name = "frontend-instance-profile"
        }
    }

  # module.network.aws_eip.nat_eip will be created
  + resource "aws_eip" "nat_eip" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "us-east-1"
      + tags                 = {
          + "Name"        = "sincerra-vpc-serverbased-dev-nat-eip"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + tags_all             = {
          + "Name"        = "sincerra-vpc-serverbased-dev-nat-eip"
          + "environment" = "development"
          + "terraform"   = "true"
        }
    }

  # module.network.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "us-east-1"
      + tags     = {
          + "Name"        = "sincerra-vpc-serverbased-dev-igw"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + tags_all = {
          + "Name"        = "sincerra-vpc-serverbased-dev-igw"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.aws_nat_gateway.nat will be created
  + resource "aws_nat_gateway" "nat" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + auto_provision_zones               = (known after apply)
      + auto_scaling_ips                   = (known after apply)
      + availability_mode                  = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "us-east-1"
      + regional_nat_gateway_address       = (known after apply)
      + regional_nat_gateway_auto_mode     = (known after apply)
      + route_table_id                     = (known after apply)
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"        = "sincerra-vpc-serverbased-dev-nat-gateway"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + tags_all                           = {
          + "Name"        = "sincerra-vpc-serverbased-dev-nat-gateway"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + vpc_id                             = (known after apply)
    }

  # module.network.aws_route.private_internet_access will be created
  + resource "aws_route" "private_internet_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "us-east-1"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.network.aws_route.public_internet_access will be created
  + resource "aws_route" "public_internet_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "us-east-1"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.network.aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "sincerra-vpc-serverbased-dev-private-rt"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + tags_all         = {
          + "Name"        = "sincerra-vpc-serverbased-dev-private-rt"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "sincerra-vpc-serverbased-dev-public-rt"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + tags_all         = {
          + "Name"        = "sincerra-vpc-serverbased-dev-public-rt"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table_association.private_assoc["us-east-1a"] will be created
  + resource "aws_route_table_association" "private_assoc" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private_assoc["us-east-1b"] will be created
  + resource "aws_route_table_association" "private_assoc" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public_assoc["us-east-1a"] will be created
  + resource "aws_route_table_association" "public_assoc" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public_assoc["us-east-1b"] will be created
  + resource "aws_route_table_association" "public_assoc" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_subnet.private["us-east-1a"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.100.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Name"        = "sincerra-vpc-serverbased-dev-private-us-east-1a"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + tags_all                                       = {
          + "Name"        = "sincerra-vpc-serverbased-dev-private-us-east-1a"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private["us-east-1b"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.200.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Name"        = "sincerra-vpc-serverbased-dev-private-us-east-1b"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + tags_all                                       = {
          + "Name"        = "sincerra-vpc-serverbased-dev-private-us-east-1b"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public["us-east-1a"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Name"        = "sincerra-vpc-serverbased-dev-public-us-east-1a"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + tags_all                                       = {
          + "Name"        = "sincerra-vpc-serverbased-dev-public-us-east-1a"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public["us-east-1b"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Name"        = "sincerra-vpc-serverbased-dev-public-us-east-1b"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + tags_all                                       = {
          + "Name"        = "sincerra-vpc-serverbased-dev-public-us-east-1b"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "us-east-1"
      + tags                                 = {
          + "Name"        = "sincerra-vpc-serverbased-dev"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + tags_all                             = {
          + "Name"        = "sincerra-vpc-serverbased-dev"
          + "environment" = "development"
          + "terraform"   = "true"
        }
    }

  # module.security_groups.aws_security_group.alb_sg will be created
  + resource "aws_security_group" "alb_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "sincerra-vpc-serverbased-dev-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "sincerra-vpc-serverbased-dev-alb-sg"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + tags_all               = {
          + "Name"        = "sincerra-vpc-serverbased-dev-alb-sg"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_groups.aws_security_group.backend_alb_sg will be created
  + resource "aws_security_group" "backend_alb_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "sincerra-vpc-serverbased-dev-backend-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "sincerra-vpc-serverbased-dev-backend-alb-sg"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + tags_all               = {
          + "Name"        = "sincerra-vpc-serverbased-dev-backend-alb-sg"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_groups.aws_security_group.backend_sg will be created
  + resource "aws_security_group" "backend_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "sincerra-vpc-serverbased-dev-backend-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "sincerra-vpc-serverbased-dev-backend-sg"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + tags_all               = {
          + "Name"        = "sincerra-vpc-serverbased-dev-backend-sg"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_groups.aws_security_group.frontend_sg will be created
  + resource "aws_security_group" "frontend_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "sincerra-vpc-serverbased-dev-frontend-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "sincerra-vpc-serverbased-dev-frontend-sg"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + tags_all               = {
          + "Name"        = "sincerra-vpc-serverbased-dev-frontend-sg"
          + "environment" = "development"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_groups.aws_security_group_rule.alb_egress_to_frontend will be created
  + resource "aws_security_group_rule" "alb_egress_to_frontend" {
      + description              = "To Frontend"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-east-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # module.security_groups.aws_security_group_rule.alb_ingress_http will be created
  + resource "aws_security_group_rule" "alb_ingress_http" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTP from Internet"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-east-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.backend_alb_egress_to_backend will be created
  + resource "aws_security_group_rule" "backend_alb_egress_to_backend" {
      + description              = "To Backend instances"
      + from_port                = 3001
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-east-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3001
      + type                     = "egress"
    }

  # module.security_groups.aws_security_group_rule.backend_alb_ingress_from_frontend will be created
  + resource "aws_security_group_rule" "backend_alb_ingress_from_frontend" {
      + description              = "HTTP from Frontend instances"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-east-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.backend_egress_all will be created
  + resource "aws_security_group_rule" "backend_egress_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all outbound traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + region                   = "us-east-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.security_groups.aws_security_group_rule.backend_ingress_from_alb will be created
  + resource "aws_security_group_rule" "backend_ingress_from_alb" {
      + description              = "HTTP from Backend ALB"
      + from_port                = 3001
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-east-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3001
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.frontend_egress_all will be created
  + resource "aws_security_group_rule" "frontend_egress_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all outbound traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + region                   = "us-east-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.security_groups.aws_security_group_rule.frontend_ingress_from_alb will be created
  + resource "aws_security_group_rule" "frontend_ingress_from_alb" {
      + description              = "HTTP from ALB"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-east-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

Plan: 44 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_dns_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

---
*Pushed by: @sabbah-ahmed | Workflow: `Terraform plan`*